app/Common.php

    function logged_in_user()
    {
        $session = session();

        if (!$session->get('isLoggedIn')) {
            return null;
        }

        // Ensure only admin can use
        if ($session->get('designation') !== 'admin') {
            return null;
        }

        $id = $session->get('id');

        $model = new AdminModel(); // use your admin table model
        $admin = $model->find($id);
---
SELECT *
FROM `tbl_admins`
WHERE `tbl_admins`.`id` = '1'

    function get_scores($where = [])
    {
        $model = new TblScoresModel();

        if (!empty($where)) {
            return $model->where($where)->findAll();
        }

        return $model->findAll();
---
SELECT *
FROM `tbl_scores`