app/Helpers/setting_helper.php

    function get_setting($key, $default = '')
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tbl_settings');
        $setting = $builder->where('key_name', $key)->get()->getRow();
---
SELECT *
FROM `tbl_settings`
WHERE `key_name` = 'company_logo'