app/Controllers/AdminController.php

    public function settings()
    {
        $settingModel = new \App\Models\SettingModel();
        $allSettings = $settingModel->findAll();
---
SELECT *
FROM `tbl_settings`

    public function testAccess()
    {
        $users     = [];
        $mockTests = [];
        $unitTests = [];

        try {
            $userModel     = new \App\Models\UserModel();
            $accessModel   = new \App\Models\UserAccessibleTestModel();
            $mockTestModel = new \App\Models\MockTestModel();
            $unitTestModel = new \App\Models\UnitTestModel();

            $users     = $userModel->findAll() ?: [];
            $mockTests = $mockTestModel->where('is_active', 1)->findAll() ?: [];
            $unitTests = $unitTestModel->where('is_active', 1)->findAll() ?: [];
---
SELECT *
FROM `tbl_users`
SELECT *
FROM `tbl_mock_tests`
WHERE `is_active` = 1
SELECT *
FROM `tbl_unit_tests`
WHERE `is_active` = 1