app/Controllers/AuthController.php

SELECT *
FROM `tbl_admins`
WHERE `email` = 'student@gmail.com'
 LIMIT 1
---
    public function forgotPasswordPost()
    {
        $data  = $this->request->getJSON(true);
        $email = $data['email'] ?? '';

        if (!$email) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Email is required'
            ]);
        }

        $adminModel = new \App\Models\AdminModel();
        $studentModel = new \App\Models\StudentModel();

        $user = $adminModel->where('email', $email)->first();

UPDATE `tbl_users` SET `password` = '$2y$10$TK3PXJbqlnmmPcvdj9pxfuBDybxhDRw/O3TfHFJE.wluVWtVCUTdm', `updated_at` = '2026-08-01 01:55:34'
WHERE `tbl_users`.`id` IN ('2')
---
            // Need ID to update
            $user = $studentModel->where('email', $sessionEmail)->first();
            if($user) {
                // Since StudentModel hashes passwords automatically, we need to bypass it or let it handle it.
                // StudentModel has a callback: beforeUpdate = ['hashPassword'].
                // So if we pass raw password, it will hash it again.
                $studentModel->update($user['id'], ['password' => $password]);