app/Controllers/StudentDashboardController.php

    public function dashboard()
    {
        $userId = session()->get('id');
        $db = \Config\Database::connect();

        $studentModel = new \App\Models\StudentModel();
        $user = $studentModel->find($userId);
        if ($user) {
            session()->set('phone', $user['phone'] ?? '');
            session()->set('profile_pic', $user['profile_pic'] ?? '');
        }

        $enrollmentModel = new EnrollmentModel();
        $announcementModel = new AnnouncementModel();

        // Join enrollments with courses to get dynamic data
        $enrollments = $enrollmentModel->where('user_id', $userId)->where('status', 'approved')->findAll();
        $enrolledCoursesCount = count($enrollments);

        // Calculate dynamic average progress
        $totalProgress = 0;
        foreach ($enrollments as $e) {
            $syncData = $this->syncCourseProgress($userId, $e['course_id']);
            $totalProgress += $syncData['progress'];
        }
        $avgProgress = $enrolledCoursesCount > 0 ? round($totalProgress / $enrolledCoursesCount) : 0;

        // Support tickets count
        $supportCount = $db->table('tbl_support_requests')->where('user_id', $userId)->where('status', 'pending')->countAllResults();

        // Completed lessons count
        $completedLessonsCount = $db->table('tbl_lesson_progress')->where('user_id', $userId)->countAllResults();
---
SELECT *
FROM `tbl_enrollments`
WHERE `user_id` = '2'
AND `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `tbl_support_requests`
WHERE `user_id` = '2'
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `tbl_lesson_progress`
WHERE `user_id` = '2'

        $activities = [];

        // 1. Quizzes (from submissions)
        $quizzes = $db->table('tbl_exam_submissions s')
            ->select('s.score, s.status, s.title as lesson_name, c.title as course_name, s.created_at')
            ->join('tbl_courses c', 'c.id = s.course_id')
            ->where('s.user_id', $userId)
            ->where('s.type', 'quiz')
            ->orderBy('s.created_at', 'DESC')
            ->limit(5)->get()->getResultArray();
---
SELECT `s`.`score`, `s`.`status`, `s`.`title` as `lesson_name`, `c`.`title` as `course_name`, `s`.`created_at`
FROM `tbl_exam_submissions` `s`
JOIN `tbl_courses` `c` ON `c`.`id` = `s`.`course_id`
WHERE `s`.`user_id` = '2'
AND `s`.`type` = 'quiz'
ORDER BY `s`.`created_at` DESC
 LIMIT 5

        }

        // 2. Lessons Completed
        $lessons = $db->table('tbl_lesson_progress p')
            ->select('l.title as lesson_name, c.title as course_name, p.created_at')
            ->join('tbl_lessons l', 'l.id = p.lesson_id')
            ->join('tbl_courses c', 'c.id = l.course_id')
            ->where('p.user_id', $userId)
            ->orderBy('p.created_at', 'DESC')
            ->limit(5)->get()->getResultArray();
---
SELECT `l`.`title` as `lesson_name`, `c`.`title` as `course_name`, `p`.`created_at`
FROM `tbl_lesson_progress` `p`
JOIN `tbl_lessons` `l` ON `l`.`id` = `p`.`lesson_id`
JOIN `tbl_courses` `c` ON `c`.`id` = `l`.`course_id`
WHERE `p`.`user_id` = '2'
ORDER BY `p`.`created_at` DESC
 LIMIT 5

        }

        // 3. Exams Submitted
        $exams = $db->table('tbl_exam_submissions s')
            ->select('s.title as lesson_name, c.title as course_name, s.created_at')
            ->join('tbl_courses c', 'c.id = s.course_id')
            ->where('s.user_id', $userId)
            ->where('s.type', 'exam')
            ->orderBy('s.created_at', 'DESC')
            ->limit(5)->get()->getResultArray();
---
SELECT `s`.`title` as `lesson_name`, `c`.`title` as `course_name`, `s`.`created_at`
FROM `tbl_exam_submissions` `s`
JOIN `tbl_courses` `c` ON `c`.`id` = `s`.`course_id`
WHERE `s`.`user_id` = '2'
AND `s`.`type` = 'exam'
ORDER BY `s`.`created_at` DESC
 LIMIT 5

        $activities = array_slice($activities, 0, 5);

        // Fetch Announcements
        $announcements = $announcementModel->groupStart()
                                            ->where('target_type', 'all')
                                            ->orWhere('student_id', $userId)
                                          ->groupEnd()
                                          ->orderBy('created_at', 'DESC')
                                          ->limit(5)
                                          ->findAll();
---
SELECT *
FROM `tbl_announcements`
WHERE   (
`target_type` = 'all'
OR `student_id` = '2'
 )
ORDER BY `created_at` DESC
 LIMIT 5