app/Controllers/WebSiteController.php

SELECT *
FROM `tbl_blogs`
WHERE `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function index(): string
    {
        $this->cachePage(60);
        $blogModel = new \App\Models\BlogModel();
        $data = [
            'latest_blogs' => $blogModel->where('status', 'published')->orderBy('created_at', 'DESC')->limit(3)->findAll()
        ];

SELECT *
FROM `tbl_testimonials`
ORDER BY `created_at` DESC
---
    public function EA()
    {
        $this->cachePage(60);
        $testModel = new \App\Models\TestimonialModel();
        $data = [
            'testimonials' => $testModel->orderBy('created_at', 'DESC')->findAll()
        ];

SELECT *
FROM `tbl_blogs`
WHERE `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function AI()
    {
        $this->cachePage(60);
        $blogModel = new \App\Models\BlogModel();
        $data = [
            'latest_blogs' => $blogModel->where('status', 'published')->orderBy('created_at', 'DESC')->limit(3)->findAll()
        ];

SELECT *
FROM `tbl_testimonials`
ORDER BY `created_at` DESC
---
    public function talent()
    {
        $this->cachePage(60);
        $testModel = new \App\Models\TestimonialModel();
        $data = [
            'testimonials' => $testModel->orderBy('created_at', 'DESC')->findAll()
        ];

SELECT *
FROM `tbl_blogs`
WHERE `status` = 'published'
ORDER BY RAND()
 LIMIT 4
SELECT *
FROM `tbl_blogs`
WHERE `status` = 'published'
ORDER BY `created_at` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `tbl_blogs`
WHERE `status` = 'published'
---
    public function blogs()
    {
        $this->cachePage(60);
        $blogModel = new \App\Models\BlogModel();

        // Fetch 4 random blogs for the Popular section
        $popular = $blogModel->where('status', 'published')
                             ->orderBy('RAND()')
                             ->limit(4)
                             ->findAll();

        // Fetch paginated blogs for the Latest section
        $data = [
            'popular' => $popular,
            'blogs'   => $blogModel->where('status', 'published')
                                 ->orderBy('created_at', 'DESC')
                                 ->paginate(6),
            'pager'   => $blogModel->pager
        ];

SELECT *
FROM `tbl_blogs`
WHERE `slug` = 'mastering-cma-ea-exams'
 LIMIT 1
SELECT *
FROM `tbl_blogs`
WHERE `status` = 'published'
AND `id` != '1'
ORDER BY `created_at` DESC
 LIMIT 3
---
    public function blogView($slug)
    {
        $blogModel = new \App\Models\BlogModel();
        $blog = $blogModel->where('slug', $slug)->first();

        if (!$blog) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $data = [
            'blog' => $blog,
            // Fetch recent blogs for sidebar
            'recent_blogs' => $blogModel->where('status', 'published')
                                       ->where('id !=', $blog['id'])
                                       ->orderBy('created_at', 'DESC')
                                       ->limit(3)
                                       ->findAll()
        ];