app/Models/SettingModel.php

    public function getSetting($key)
    {
        return $this->where('key_name', $key)->first();
---
SELECT *
FROM `tbl_settings`
WHERE `key_name` = 'director_signature'
 LIMIT 1