app/Models/UserAccessibleTestModel.php

    public function getByUser($userId)
    {
        return $this->where('user_id', $userId)->first();
---
SELECT *
FROM `tbl_user_accessible_tests`
WHERE `user_id` = '2'
 LIMIT 1